LQM2015/stm32/Core/Src/audio_recorder.c
/**
 * @file audio_recorder.c
 * @brief Audio recorder implementation for I2S TDM PCM data recording
 * @date 2025-01-28
 */

/* Includes ------------------------------------------------------------------*/
#include "../Inc/audio_recorder.h"
#include "sai.h"
#include "fatfs.h"
#include "shell_log.h"
#include "fs_manager.h"
#include "diskio.h"  // For SD card status checking
#include <string.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include "cmsis_os.h"
#include "stm32h7xx_hal.h" // For SCB_InvalidateDCache_by_Addr

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
// 独立的文件对象，避免与录音器结构体混在一起被踩踏
static FIL g_audio_file __attribute__((section(".dma_buffer"))) __attribute__((aligned(32)));

// 音频录制器实例，使用DMA安全的内存区域
#if defined ( __GNUC__ )
__attribute__((section(".dma_buffer"), aligned(32)))
#endif
static AudioRecorder_t recorder = {0};
/* DMA buffer: placed in .dma_buffer (linker -> D3 SRAM 0x38000000) with 32-byte alignment.
 * Region configured via MPU (Region7) as non-cacheable & shareable, so no runtime cache maintenance required.
 * Rationale: BDMA cannot access DTCM; non-cacheable removes need for Clean/Invalidate calls.
 * Buffer size is calculated based on AUDIO_CHANNELS and AUDIO_BUFFER_FRAMES configuration.
 */
#if defined ( __GNUC__ )
__attribute__((section(".dma_buffer"), aligned(32)))
#endif
static uint16_t audio_buffer[AUDIO_BUFFER_SAMPLES]; // 16-bit samples interleaved multi-channel TDM
static volatile bool buffer_ready = false;
static volatile bool half_buffer_ready = false;

static osSemaphoreId_t audio_data_sem = NULL;
static osThreadId_t audio_process_thread_id = NULL;

// 降低SAI回调打印频次的计数器
static uint32_t rx_complete_counter = 0;
static uint32_t rx_half_counter = 0;
#define RX_CALLBACK_LOG_INTERVAL 50  // 每50次回调打印一次

// External variables from fatfs
extern FATFS USERFatFS;
extern char USERPath[4];

/* Private function prototypes -----------------------------------------------*/
static void generate_filename(char* filename, size_t size);
static int write_audio_data(uint16_t* data, uint32_t size);
static void debug_sai_status(void);
static void monitor_sai_timing(void);
static void reset_sai_timing_status(void);
void audio_recorder_process(void);
static int check_sd_card_status(void);
static int check_sd_card_busy(void);
static int is_sd_card_ready_for_write(void);
static void audio_process_thread(void *argument);
static int verify_file_exists(const char* filepath);

/* Private functions ---------------------------------------------------------*/

/**
 * @brief Generate filename based on audio parameters
 * @param filename: Buffer to store filename
 * @param size: Buffer size
 */
static void generate_filename(char* filename, size_t size)
{
    // For now, use a simple counter-based naming
    static uint32_t file_counter = 0;
    file_counter++;
    
    snprintf(filename, size, "audio_%dch_%dbit_%dHz_%03lu.pcm", 
             AUDIO_CHANNELS, AUDIO_BIT_DEPTH, AUDIO_SAMPLE_RATE, file_counter);
}

/**
 * @brief Write audio data to SD card
 * @param data: Audio data buffer
 * @param size: Data size in bytes
 * @retval 0: Success, -1: Error
 */
/**
 * @brief Write audio data to SD card with periodic sync
 * @param data: Audio data buffer
 * @param size: Data size in bytes
 * @retval 0: Success, -1: Error
 */
static int write_audio_data(uint16_t* data, uint32_t size)
{
    UINT bytes_written;
    FRESULT res;
    static uint32_t writes_since_sync = 0;
    const uint32_t SYNC_INTERVAL = 16; // 增加同步间隔，降低同步频率 (从8改为16)

    // Check for reentrant calls - prevent interrupt collision
    if (recorder.write_in_progress) {
        // 重入冲突：返回特殊值-2，区别于真正的写入错误-1
        // 禁用频繁的错误日志，避免UART传输影响SD卡操作
        // SHELL_LOG_USER_ERROR("Write operation already in progress - skipping");
        return -2;  // 重入冲突
    }
    
    // Set write-in-progress flag
    recorder.write_in_progress = true;
    
    if (!recorder.file_open) {
        SHELL_LOG_USER_ERROR("Cannot write data, file not open");
        recorder.write_in_progress = false;
        return -1;
    }
    
    // Check if SD card is ready for write operations
    if (is_sd_card_ready_for_write() != 0) {
        SHELL_LOG_USER_ERROR("SD card not ready for write operation");
        recorder.write_in_progress = false;
        return -1;
    }
    
    // Verify file object validity before writing
    if (g_audio_file.obj.fs == NULL) {
        SHELL_LOG_USER_ERROR("File object invalid - filesystem pointer is NULL");
        recorder.file_open = false;
        recorder.write_in_progress = false;
        return -1;
    }
    
    // 额外的文件对象完整性检查
    if (g_audio_file.obj.id == 0 || g_audio_file.flag == 0) {
        SHELL_LOG_USER_ERROR("File object corrupted - ID: %d, Flag: %d", 
                            g_audio_file.obj.id, g_audio_file.flag);
        recorder.file_open = false;
        recorder.write_in_progress = false;
        return -1;
    }
    
    // 检查文件错误标志
    if (g_audio_file.err != 0) {
        SHELL_LOG_USER_ERROR("File object has error flag set: %d", g_audio_file.err);
        recorder.file_open = false;
        recorder.write_in_progress = false;
        return -1;
    }
    
    // 额外的文件对象内存检查
    if ((uint32_t)&g_audio_file < 0x20000000 || (uint32_t)&g_audio_file > 0x2007FFFF) {
        if ((uint32_t)&g_audio_file < 0x24000000 || (uint32_t)&g_audio_file > 0x2407FFFF) {
            if ((uint32_t)&g_audio_file < 0x38000000 || (uint32_t)&g_audio_file > 0x3807FFFF) {
                SHELL_LOG_USER_ERROR("File object at invalid memory location: %p", &g_audio_file);
                recorder.file_open = false;
                recorder.write_in_progress = false;
                return -1;
            }
        }
    }
    
    // 关键修复：禁用中断防止文件操作被重入
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    
    // Write all data at once
    res = f_write(&g_audio_file, data, size, &bytes_written);
    
    // 确保写入操作完成 (内存屏障)
    __DSB();
    __ISB();
    
