LQM2015/stm32/Core/Src/audio_recorder.c
    if (disk_stat & STA_PROTECT) {
        SHELL_LOG_USER_ERROR("SD card is write protected");
        return -1;
    }
    
    // Additional check: try to get SD card state via HAL
    extern SD_HandleTypeDef hsd1;  // Assuming this is your SD handle
    HAL_SD_CardStateTypeDef card_state = HAL_SD_GetCardState(&hsd1);
    
    if (card_state != HAL_SD_CARD_TRANSFER) {
        SHELL_LOG_USER_WARNING("SD card not in transfer state: %d", card_state);
        return -1;
    }
    
    return 0;  // Ready for write
}

/**
 * @brief Check if SD card is ready for write operations (comprehensive check)
 * @retval 0: Ready, -1: Not ready
 */
static int is_sd_card_ready_for_write(void)
{
    // First check if card is busy
    if (check_sd_card_busy() != 0) {
        return -1;
    }
    
    // Try a sync operation to see if disk is responsive
    DRESULT ioctl_result = disk_ioctl(0, CTRL_SYNC, NULL);
    
    if (ioctl_result != RES_OK) {
        SHELL_LOG_USER_WARNING("SD card sync check failed, DRESULT: %d", ioctl_result);
        switch (ioctl_result) {
            case RES_ERROR:
                SHELL_LOG_USER_ERROR("SD card I/O error");
                break;
            case RES_WRPRT:
                SHELL_LOG_USER_ERROR("SD card write protected");
                break;
            case RES_NOTRDY:
                SHELL_LOG_USER_ERROR("SD card not ready");
                break;
            case RES_PARERR:
                SHELL_LOG_USER_ERROR("SD card parameter error");
                break;
            default:
                SHELL_LOG_USER_ERROR("SD card unknown error: %d", ioctl_result);
                break;
        }
        return -1;
    }
    
    return 0;  // Ready for write
}

/**
 * @brief Check SD card status and try to fix common issues
 * @retval 0: Success, -1: Error
 */
static int check_sd_card_status(void)
{
    SHELL_LOG_USER_INFO("=== SD Card Status Check ===");
    
    // 检查全局文件系统管理器状态
    if (fs_manager_check_status() == 0) {
        SHELL_LOG_USER_INFO("SD card is accessible via global fs manager");
        return 0;
    }
    
    SHELL_LOG_USER_WARNING("SD card not accessible via global fs manager");
    
    // 尝试使用文件系统管理器重新挂载
    SHELL_LOG_USER_INFO("Attempting to fix SD card access via fs manager...");
    
    if (fs_manager_remount() == 0) {
        SHELL_LOG_USER_INFO("SD card access restored successfully");
        return 0;
    }
    
    SHELL_LOG_USER_ERROR("Failed to restore SD card access");
    return -1;
}

/**
 * @brief Verify if a file exists on SD card (only when file is not currently open)
 * @param filepath: Path to check
 * @retval 0: File exists, -1: File doesn't exist
 */
static int verify_file_exists(const char* filepath)
{
    FILINFO fno;
    FRESULT res = f_stat(filepath, &fno);
    if (res == FR_OK) {
        SHELL_LOG_USER_INFO("File %s exists, size: %lu bytes", filepath, (unsigned long)fno.fsize);
        return 0;
    } else {
        SHELL_LOG_USER_WARNING("File %s does not exist, FRESULT: %d", filepath, res);
        return -1;
    }
}

/* Exported functions --------------------------------------------------------*/

/**
 * @brief Initialize audio recorder
 * @retval 0: Success, -1: Error
 */
int audio_recorder_init(void)
{
    SHELL_LOG_USER_INFO("Initializing audio recorder...");
    
    // 清零文件对象确保干净状态，添加内存屏障
    memset(&g_audio_file, 0, sizeof(FIL));
    __DSB();  // 确保内存清零完成
    
    // Initialize recorder structure
    recorder.channels = AUDIO_CHANNELS;
    recorder.bit_depth = AUDIO_BIT_DEPTH;
    recorder.sample_rate = AUDIO_SAMPLE_RATE;
    recorder.state = AUDIO_REC_IDLE;
    recorder.buffer_size = AUDIO_BUFFER_SIZE;
    recorder.bytes_written = 0;
    recorder.file_open = false;
    
    SHELL_LOG_USER_INFO("Config: %d channels, %d-bit, %d Hz, buffer size: %lu", 
           recorder.channels, recorder.bit_depth, recorder.sample_rate, (unsigned long)recorder.buffer_size);
    
    // Clear audio buffer
    memset(audio_buffer, 0, sizeof(audio_buffer));

    // Create semaphore for data processing
    audio_data_sem = osSemaphoreNew(1, 0, NULL);
    if (audio_data_sem == NULL) {
        SHELL_LOG_USER_ERROR("Failed to create audio data semaphore");
        return -1;
    }

    // Create audio processing thread
    const osThreadAttr_t audio_process_thread_attributes = {
        .name = "AudioProcess",
        .stack_size = 1024 * 4, // 4KB stack
        .priority = (osPriority_t) osPriorityHigh,
    };
    audio_process_thread_id = osThreadNew(audio_process_thread, NULL, &audio_process_thread_attributes);
    if (audio_process_thread_id == NULL) {
        SHELL_LOG_USER_ERROR("Failed to create audio processing thread");
        return -1;
    }
    
    SHELL_LOG_USER_INFO("Audio recorder initialization completed, state: %d", recorder.state);
    return 0;
}

/**
 * @brief Reset audio recorder to clean state (force reset)
 * @retval 0: Success, -1: Error
 */
int audio_recorder_reset(void)
{
    SHELL_LOG_USER_INFO("Force resetting audio recorder...");
    SHELL_LOG_USER_DEBUG("Current state before reset: %d", recorder.state);
    
    // Force stop SAI if it's running
    if (HAL_SAI_GetState(&hsai_BlockA4) != HAL_SAI_STATE_READY) {
        SHELL_LOG_USER_INFO("Forcing SAI DMA stop...");
        HAL_SAI_DMAStop(&hsai_BlockA4);
        HAL_SAI_Abort(&hsai_BlockA4);
        
        // Wait for SAI to stop
        uint32_t timeout = HAL_GetTick() + 200;
        while (HAL_SAI_GetState(&hsai_BlockA4) != HAL_SAI_STATE_READY && HAL_GetTick() < timeout) {
            vTaskDelay(1);
        }
    }
    
    // Force close file if it's open
    if (recorder.file_open) {
        SHELL_LOG_USER_INFO("Force closing file...");
        f_close(&g_audio_file);
        recorder.file_open = false;
    }
    
    // Clear file object
    memset(&g_audio_file, 0, sizeof(FIL));
    __DSB();
    
    // Reset all recorder state
    recorder.state = AUDIO_REC_IDLE;
    recorder.bytes_written = 0;
    recorder.write_in_progress = false;
    
